{
  "en": {
    "pageTitle": "EMERALD SHORES - Phuket's Finest Properties",
    "navHome": "Home",
    "navServices": "Services",
    "navGallery": "Gallery",
    "navAbout": "About",
    "navTestimonials": "Testimonials",
    "navContact": "Contact Us",
    "bannerTitle": "Welcome to Emerald Shores",
    "bannerSubtitle": "<b>Discover Phuket's Finest Properties</b>",
    "bannerButton": "CONTACT US AND DISCOVER THE OFFER",
    "servicesSuccess": "SUCCESS",
    "servicesTitle": "Helping You Invest in Phuket’s Best Properties",
    "servicesSubtitle": "At Emerald Shores, we specialize in guiding investors and homebuyers through the process of purchasing premium properties in Thailand. With exclusive developer deals, expert market insights, and flexible payment plans, we make property investment seamless and rewarding.",
    "paymentPlanTitle": "Payment plan",
    "paymentPlanText": "Some of the developers we work with offer flexible financing options, such as a 60/40 payment plan – where you pay 60% upfront to secure the property and the remaining 40% is spread over 15 years.",
    "partnershipsTitle": "Strong Developer Partnerships",
    "partnershipsText": "Build and maintain strong relationships with reputable developers to secure high-quality property listings and exclusive deals.",
    "customerServiceTitle": "Exceptional Customer Service",
    "customerServiceText": "Provide personalized support to buyers, guiding them through the purchasing process with transparency, trust, and expert knowledge of the market.",
    "afterSalesTitle": "Comprehensive After-Sales Services",
    "afterSalesText": "Provide property management and rental services, ensuring buyers can generate income from their investments with hassle-free maintenance and tenant management.",
    "propertyMatchingTitle": "Tailored Property Matching",
    "propertyMatchingText": "We take the time to understand your goals—whether it’s investment, relocation, or holiday living—and match you with the right property to suit your needs, lifestyle, and budget.",
    "testimonial1": "Outstanding service! The team went above and beyond to ensure a smooth and hassle-free experience. Their professionalism, attention to detail, and commitment to customer satisfaction truly set them apart. Highly recommend!",
    "testimonial1Author": "— Peter, Happy Customer",
    "aboutBelieving": "BELIEVING",
    "aboutTitle": "Focusing On What Matters Most",
    "aboutSubtitle": "At Emerald Shores, we believe that real estate is more than just buying and selling properties—it’s about making smart investments that bring long-term value and peace of mind. That’s why we focus on what truly matters: trust, transparency, and delivering exceptional service every step of the way.",
    "aboutText1": "We understand that purchasing a property is a significant decision, whether it’s for personal use, a holiday home, or a long-term investment. Our role as your trusted agency is to simplify the process, providing expert guidance, market insights, and exclusive property opportunities that align with your goals.",
    "aboutText2": "But our commitment doesn’t end at the sale. We go beyond by offering full-service property management and rental solutions, ensuring that your investment continues to work for you. From marketing your property to handling tenant relations, maintenance, and financial management, we take care of everything—so you can enjoy the benefits without the hassle.",
    "feedbackTitle": "FEEDBACK",
    "feedbackSubtitle": "What our customers are saying",
    "customer1Feedback": "“I was initially hesitant about investing overseas, but Emerald Shores guided me through every step. Their market insights and strong connections with developers secured me an amazing deal!”",
    "customer1Author": "James – United Kingdom",
    "customer2Feedback": "“Emerald Shores made buying property in Thailand incredibly easy. From handling legal documents to finding the perfect investment, their team was professional and knowledgeable. Highly recommended!”",
    "customer2Author": "Anna – Poland",
    "customer3Feedback": "“The team at Emerald Shores truly understands the needs of international buyers. They helped me find a great rental property in Phuket that now generates passive income hassle-free!”",
    "customer3Author": "Sarah – USA",
    "contactTrust": "TRUST",
    "contactTitle": "Contact Us",
    "emailTitle": "Email",
    "phoneTitle": "Phone / WhatsApp",
    "copyright": "© 2025 Emerald Shores Ltd. All rights reserved."
  },
  "pl": {
    "pageTitle": "EMERALD SHORES - Najlepsze nieruchomości na Phuket",
    "navHome": "Strona główna",
    "navServices": "Usługi",
    "navGallery": "Galeria",
    "navAbout": "O nas",
    "navTestimonials": "Opinie",
    "navContact": "Kontakt",
    "bannerTitle": "Witamy w Emerald Shores",
    "bannerSubtitle": "<b>Odkryj najlepsze nieruchomości na Phuket</b>",
    "bannerButton": "SKONTAKTUJ SIĘ Z NAMI I ODKRYJ OFERTĘ",
    "servicesSuccess": "SUKCES",
    "servicesTitle": "Pomagamy inwestować w najlepsze nieruchomości na Phuket",
    "servicesSubtitle": "W Emerald Shores specjalizujemy się w prowadzeniu inwestorów i nabywców domów przez proces zakupu nieruchomości premium w Tajlandii. Dzięki ekskluzywnym ofertom deweloperskim, eksperckiej wiedzy rynkowej i elastycznym planom płatności, sprawiamy, że inwestowanie w nieruchomości jest płynne i satysfakcjonujące.",
    "paymentPlanTitle": "Plan płatności",
    "paymentPlanText": "Niektórzy deweloperzy, z którymi współpracujemy, oferują elastyczne opcje finansowania, takie jak plan płatności 60/40 – gdzie płacisz 60% z góry, aby zabezpieczyć nieruchomość, a pozostałe 40% jest rozłożone na 15 lat.",
    "partnershipsTitle": "Silne partnerstwa z deweloperami",
    "partnershipsText": "Budujemy i utrzymujemy silne relacje z renomowanymi deweloperami, aby zapewnić wysokiej jakości oferty nieruchomości i ekskluzywne okazje.",
    "customerServiceTitle": "Wyjątkowa obsługa klienta",
    "customerServiceText": "Zapewniamy spersonalizowane wsparcie dla kupujących, prowadząc ich przez proces zakupu z przejrzystością, zaufaniem i ekspercką wiedzą o rynku.",
    "afterSalesTitle": "Kompleksowe usługi posprzedażowe",
    "afterSalesText": "Świadczymy usługi zarządzania nieruchomościami i wynajmu, zapewniając kupującym możliwość generowania dochodu z inwestycji przy bezproblemowej konserwacji i zarządzaniu najemcami.",
    "propertyMatchingTitle": "Dopasowanie nieruchomości na miarę",
    "propertyMatchingText": "Poświęcamy czas na zrozumienie Twoich celów — czy to inwestycja, przeprowadzka, czy dom wakacyjny — i dopasowujemy Cię do odpowiedniej nieruchomości, która odpowiada Twoim potrzebom, stylowi życia i budżetowi.",
    "testimonial1": "Znakomita obsługa! Zespół dołożył wszelkich starań, aby zapewnić płynne i bezproblemowe doświadczenie. Ich profesjonalizm, dbałość o szczegóły i zaangażowanie w zadowolenie klienta naprawdę ich wyróżniają. Gorąco polecam!",
    "testimonial1Author": "— Piotr, zadowolony klient",
    "aboutBelieving": "WIARA",
    "aboutTitle": "Skupienie się na tym, co najważniejsze",
    "aboutSubtitle": "W Emerald Shores wierzymy, że nieruchomości to coś więcej niż tylko kupno i sprzedaż — to dokonywanie inteligentnych inwestycji, które przynoszą długoterminową wartość i spokój ducha. Dlatego skupiamy się na tym, co naprawdę ma znaczenie: zaufaniu, przejrzystości i dostarczaniu wyjątkowych usług na każdym kroku.",
    "aboutText1": "Rozumiemy, że zakup nieruchomości to ważna decyzja, niezależnie od tego, czy jest to do użytku osobistego, dom wakacyjny, czy długoterminowa inwestycja. Naszą rolą jako zaufanej agencji jest uproszczenie tego procesu, zapewniając fachowe doradztwo, wgląd w rynek i ekskluzywne możliwości nieruchomości, które są zgodne z Twoimi celami.",
    "aboutText2": "Ale nasze zaangażowanie nie kończy się na sprzedaży. Wykraczamy poza to, oferując pełną obsługę zarządzania nieruchomościami i rozwiązania w zakresie wynajmu, zapewniając, że Twoja inwestycja nadal dla Ciebie pracuje. Od marketingu Twojej nieruchomości po obsługę relacji z najemcami, konserwację i zarządzanie finansami, dbamy o wszystko — abyś mógł cieszyć się korzyściami bez kłopotów.",
    "feedbackTitle": "OPINIE",
    "feedbackSubtitle": "Co mówią nasi klienci",
    "customer1Feedback": "“Początkowo wahałem się przed inwestowaniem za granicą, ale Emerald Shores poprowadziło mnie przez każdy krok. Ich znajomość rynku i silne powiązania z deweloperami zapewniły mi niesamowitą ofertę!”",
    "customer1Author": "Jakub – Wielka Brytania",
    "customer2Feedback": "“Emerald Shores sprawiło, że kupno nieruchomości w Tajlandii było niezwykle proste. Od załatwiania dokumentów prawnych po znalezienie idealnej inwestycji, ich zespół był profesjonalny i kompetentny. Gorąco polecam!”",
    "customer2Author": "Anna – Polska",
    "customer3Feedback": "“Zespół Emerald Shores naprawdę rozumie potrzeby międzynarodowych nabywców. Pomogli mi znaleźć świetną nieruchomość na wynajem w Phuket, która teraz generuje pasywny dochód bez żadnych problemów!”",
    "customer3Author": "Sara – USA",
    "contactTrust": "ZAUFANIE",
    "contactTitle": "Skontaktuj się z nami",
    "emailTitle": "Email",
    "phoneTitle": "Telefon / WhatsApp",
    "copyright": "© 2025 Emerald Shores Ltd. Wszelkie prawa zastrzeżone."
  }
}